#include "../inc/menu.h"


// Интерфейс главного меню
void interface_main_menu()
{
    printf("\n%s",
        "*****Главное меню*****\n"
        "Выберите пункт:\n"
        "1. Прочитать инструкцию.\n"
        "2. Открыть меню работы со стэком\n"
        "\n"
        "0. Завершить программу.\n"
        ">>> "
    );
}

// Инструкция к программе
void interface_read_me()
{
    printf("\n%s",
        "*****Инструкция*****\n"
        "\n#Общая информация:\n"
        "Программа выводит убывающие последовательности\n"
        "целых чисел с помощью стэка.\n"
        "\nИнформация о вводе:\n"
        "1. Элементы представляют собой целые числа, умещающиеся в тип int.\n"
        "2. Ввод элементов обязательно в виде убывающей последовательности.\n"
        "3. Размер стэка ограничен значениями от 0 до 20 элементов.\n"
        "4. При автоматическй генерации убывающей последовательности\n"
        "   сначала вводится наибольшее число последовательности, а потом наименьшее.\n"
    );
}

// Интерфейс работы со стэком
void interface_work_with_stack()
{
    printf("\n%s",
        "*****Меню работы со стэком*****\n"
        "Выберите вид стэка:\n"
        "1. Стэк на массиве.\n"
        "2. Стэк на связанном списке.\n"
        "0. Вернуться в главное меню.\n"
        ">>> "
    );
}

// Интерфейс работы со стэком на массиве
void interface_work_with_array_stack()
{
    printf("\n%s",
        "*****Меню работы со стэком на массиве*****\n"
        "1. Заполнить стэк вручную.\n"
        "2. Заполнить стэк автоматически.\n"
        "3. Вывести элементы стэка.\n"
        "4. Описание стэка.\n"
        "0. Вернуться в главное меню.\n"
        ">>> "
    );
}

// Интерфейс работы со стэком на связанном списке
void interface_work_with_list_stack()
{
    printf("\n%s",
        "*****Меню работы со стэком на связанном списке*****\n"
        "1. Заполнить стэк вручную.\n"
        "2. Заполнить стэк автоматически.\n"
        "3. Вывести элементы стэка.\n"
        "4. Описание стэка.\n"
        "0. Вернуться в главное меню.\n"
        ">>> "
    );
}