#include "../inc/interface.h"

void print_name_of_program()
{
    printf("*****Программа сложения разреженных матриц.*****\n");
}

void print_main_menu()
{
    printf("%s",
    "\nГлавное меню:\n"
    "0. Закрыть программу\n"
    "1. Показать информацию о вводе.\n"
    "2. Сгенерировать матрицы в файл.\n"
    "3. Считать матрицы из файла.\n"
    "4. Ввести матрицы вручную.\n"
    "5. Вывести матрицы на экран.\n"
    "6. Сложить матрицы.\n"
    ">>> ");
}

void print_input_info()
{
    printf("%s",
    "\n***Информация о вводе***\n"
    "#Для обычного ввода:\n"
    "Сначала вводится размер матрицы. Два натуральных числа.\n"
    "Далее вводятся сами элементы матрицы\n"
    "#Для разреженного ввода:\n"
    "Сначала вводятся все значения не равные нулю.\n"
    "Далее вводятся строки, которые занимают данные элементы.\n"
    "Потом вводятся индексы элементов, с которых начинается столбец.\n");
}

void print_matrix_output_interface()
{
    printf("%s",
    "\n***Вывод матриц на экран***\n"
    "#Выберите формат вывода матриц.\n"
    "1. Обычный.\n"
    "2. Разреженный.\n"
    ">>> ");
}

void print_matrix_input_interface()
{
    printf("%s",
    "\n***Ввод матриц на экран***\n"
    "#Выберите формат ввода матриц.\n"
    "1. Обычный.\n"
    "2. Разреженный.\n"
    ">>> ");
}

// Вывести на экран интерфейс сложения матриц
void print_matrix_menu_calculate_interface()
{
    printf("%s",
    "\n***Сложение матриц***\n"
    "#Выберите формат сложения матриц.\n"
    "1. Обычный.\n"
    "2. Разреженный.\n"
    ">>> ");
}

// Вывести на экран интерфейс вывода результата сложения
void print_matrix_calculate_interface()
{
    printf("%s",
    "\n***Вывод результата сложения матриц***\n"
    "#Выберите формат вывода результата.\n"
    "0. Не выводить результат.\n"
    "1. Обычный.\n"
    "2. Разреженный.\n"
    ">>> ");
}