#include "../inc/interface.h"

void print_main_menu_interface()
{
    printf("%s",
    "\n<Главное меню>\n"
    "1. Справочная информация о формате ввода.\n"
    "2. Вывести всех абонентов на экран.\n"
    "3. Перейти в меню сортировки.\n"
    "4. Добавить абонента в конец таблицы.\n"
    "5. Удалить абонента по указанному полю.\n"
    "6. Узнать ближайшие дни рождения\n"
    "7. Закрыть программу\n"
    );
}

void print_sort_menu_interface()
{
    printf("%s",
    "\n<Сортировка по фамилии>\n"
    "1. Вывести отсортированный список абонентов (сортировка пузырьком с помощью ключей).\n"
    "2. Вывести отсортированный список абонентов (сортировка пузырьком без помощи ключей).\n"
    "3. Вывести отсортированный список абонентов (быстрая сортировка с помощью ключей).\n"
    "4. Вывести отсортированный список абонентов (быстрая сортировка без помощи ключей).\n"
    "5. Сравнить скорости сортировки.\n"
    );
}

void print_sort_comparison_interface()
{
    printf("%s",
    "\n<Сравнение сортировок>\n"
    "Из предыдущего пункта выберите сортировки, которые хотите сравнить: \n"
    );
}

void print_input_info()
{
    printf("%s",
    "\n<Информация о вводе>\n"
    "<Общая информация>"
    "\nФамилия: строка от 1 до 30 символов."
    "\nИмя: строка от 1 до 30 символов."
    "\nНомер: целое число от 1 до 19 цифр."
    "\nАдрес: строка от 1 до 50 символов."
    "\nСтатус: строка от 1 символ."
    "\n<Личный статус>"
    "\nГод: целое число от 1 до 2020."
    "\nМесяц: целое число от 1 до 12."
    "\nДень: целое число от 1 до 31."
    "\n<Служебный статус>"
    "\nДолжность: строка от 1 до 30 символов."
    "\nОрганизация: строка от 1 до 30 символов.\n"
    );
}
